TEST_NANOSCALE_POLIMI/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ULTRA-FINE NANOSCALE MESH FOR POLIMI HPC
// Target resolution: 1-5 nm cells in critical regions
// Total cells: ~102 Million
// Optimized for complete LIFT process: heating → melting → vaporization → solidification

scale 1e-6; // coordinates in micrometers

// LIFT GEOMETRY (bottom to top):
// y0 = 0.0000     - Substrate (receiver) bottom
// y1 = 8.0000     - Substrate top / Air gap bottom
// y2 = 20.0000    - Air gap top / Ti film bottom
// y3 = 20.0714    - Ti film top (71.4 nm thick)

vertices
(
    // y0 = 0.0000 (substrate/receiver bottom)
    (0   0.0000  0)  (50  0.0000  0)  (50  0.0000 10)  (0   0.0000 10)

    // y1 = 8.0000 (substrate top / air gap bottom)
    (0   8.0000  0)  (50  8.0000  0)  (50  8.0000 10)  (0   8.0000 10)

    // y2 = 20.0000 (air gap top / Ti film bottom)
    (0  20.0000  0)  (50 20.0000  0)  (50 20.0000 10)  (0  20.0000 10)

    // y3 = 20.0714 (Ti film top) - 71.4 nm thick film
    (0  20.0714  0)  (50 20.0714  0)  (50 20.0714 10)  (0  20.0714 10)
);

blocks
(
    // Substrate (receiver) - 8 μm thick
    // Resolution: Δx=200nm, Δy=5nm, Δz=100nm
    // Cells: 250 × 1600 × 100 = 40M cells
    hex ( 0  3  2  1   4  7  6  5)   (250 1600 100)  simpleGrading (1 1 1)

    // Air gap - 12 μm thick
    // Resolution: Δx=200nm, Δy=5nm, Δz=100nm
    // Cells: 250 × 2400 × 100 = 60M cells
    hex ( 4  7  6  5   8 11 10  9)   (250 2400 100)  simpleGrading (1 1 1)

    // Ti film - 71.4 nm thick (critical nanoscale region)
    // Resolution: Δx=200nm, Δy=~1nm, Δz=100nm
    // Cells: 250 × 72 × 100 = 1.8M cells
    hex ( 8 11 10  9  12 15 14 13)   (250 72 100)  simpleGrading (1 1 1)
);

edges ();

boundary
(
    // Symmetry planes (external boundaries only)
    left          { type symmetryPlane; faces ((0 3 7 4)(4 7 11 8)(8 11 15 12)); }
    right         { type symmetryPlane; faces ((1 5 6 2)(5 9 10 6)(9 13 14 10)); }
    front         { type symmetryPlane; faces ((0 4 5 1)(4 8 9 5)(8 12 13 9)); }
    back          { type symmetryPlane; faces ((3 2 6 7)(7 6 10 11)(11 10 14 15)); }

    // Physical walls
    substrate     { type wall;  faces ((0 3 2 1)); }      // BOTTOM - receiver substrate
    donor         { type wall;  faces ((12 15 14 13)); }   // TOP - transparent donor substrate
);

mergePatchPairs();

// NANOSCALE MESH INFORMATION:
// =============================
// Total cells: ~102 Million
//
// Cell sizes:
// -----------
// Substrate:  200 nm × 5 nm × 100 nm
// Air gap:    200 nm × 5 nm × 100 nm
// Ti film:    200 nm × 1 nm × 100 nm (NANOSCALE!)
//
// Aspect ratios:
// --------------
// Substrate:  40:1:20 (reasonable for diffusion)
// Air gap:    40:1:20 (reasonable for heat transfer)
// Ti film:    200:1:100 (high aspect ratio for nanoscale layer)
//
// Physics captured:
// -----------------
// - Nanoscale heat diffusion in Ti film (1 nm resolution)
// - Electron-phonon coupling at sub-10nm scale
// - Interface tracking during phase change
// - Thermal gradients during heating and solidification
// - Recoil pressure and material ejection
//
// Recommended decomposition: 128-256 cores (PoliMi HPC)

// ************************************************************************* //
