TEST_NANOSCALE_POLIMI/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// COMPLETE LIFT PROCESS: HEATING → MELTING → VAPORIZATION → EJECTION → SOLIDIFICATION
// Ultra-fine nanoscale simulation for PoliMi HPC cluster

application     compInterFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;

// EXTENDED SIMULATION TIME for complete solidification
// Phase 1 (0-200 ps):     Laser heating and initial material response
// Phase 2 (200-500 ps):   Material ejection and transfer
// Phase 3 (500-2000 ps):  Cooling and solidification (2 ns total)
endTime         2e-9;          // 2 nanoseconds - complete LIFT cycle

// TIME STEPPING - Adaptive with stability constraints
deltaT          1e-16;         // Initial: 0.1 fs (very small for nanoscale)
maxDeltaT       5e-15;         // Maximum: 5 fs (adaptive growth allowed)
minDeltaT       1e-17;         // Minimum: 0.01 fs (ultimate precision)

// COURANT NUMBER CONSTRAINTS
maxCo           0.15;          // Flow Courant (conservative for nanoscale)
maxAlphaCo      0.25;          // Interface Courant (tight control)
maxThermalCourant 0.15;        // Thermal diffusion Courant (critical for 1nm cells!)
maxDi           8;             // Interface dilation limit

// ADAPTIVE TIME STEPPING
adjustTimeStep  yes;
writeControl    adjustableRunTime;
writeInterval   2e-13;         // Write every 200 fs initially

purgeWrite      200;           // Keep many snapshots for analysis
writeFormat     binary;        // Binary for speed and storage
writePrecision  10;            // High precision for nanoscale
writeCompression off;          // No compression for HPC performance
timeFormat      scientific;
timePrecision   12;            // Ultra-high precision for femtosecond tracking
fileHandler     uncollated;    // Better for HPC parallel I/O

runTimeModifiable yes;
verbose         true;
enableLiftProcessTracker true;

// LASER TIMING
laserStartTime      0;
laserEndTime        2e-10;     // 200 ps laser interaction window

// PHASE CHANGE MODEL - Complete cycle
phaseChangeCoeffs
{
    model               clausius_clapeyron;
    hf                  [0 2 -2 0 0 0 0] 9.1e6;      // J/kg - Ti vaporization enthalpy
    gasConstant         [0 2 -2 -1 0 0 0] 174;       // J/kg/K - Ti vapor
    Tsol                [0 0 0 1 0 0 0] 1941;        // K - Melting point
    Tvap                [0 0 0 1 0 0 0] 2200;        // K - Superheated evaporation onset

    // Kinetic theory parameters
    evaporationCoeff       0.3;        // Ti evaporation coefficient
    alphaMin              0.001;
    dtFloor             1e-16;         // Match minimum timestep
    relaxationTime      1e-12;         // Fast response for fs dynamics
    maxSource           [1 -1 -3 0 0 0 0] 1e22;
    minCoefficient      1e6;
    onlyAboveVapor      false;         // Allow recoil in superheated regime

    // EXTENDED ACTIVATION - through complete LIFT cycle
    activationTime      ((0 2e-9));    // Active for full 2 ns
}

// MASS TRANSFER - Extended for complete transfer and solidification
massTransferCoeffs
{
    tStart  (0);
    tEnd    (2e-9);        // Active through complete cycle
    rateMax 3e13;          // High enough for complete film ablation
}

// ADVANCED INTERFACE CAPTURING - Optimized for nanoscale
useAdvancedInterfaceCapturing  true;

advancedInterfaceCapturing
{
    model               kinetic_theory;
    stickingCoeff       0.18;
    momentumAccommodationCoeff       0.18;
    recoilTempOffset      0;
    phaseChangeTempOffset 0;
    massRateEps           1e-6;
    recoilMax             3.0e9;       // GPa-level recoil pressures
    clampRecoil           false;
    scaleRecoilMax        false;
    recoilRelax           0.5;
    alphaMin              0.001;
    maxPhysicalTemperature 10000;      // Allow extreme temperatures
    maxRecoilPressure   3.0e9;
}

logRecoilSuppression true;

// TEMPERATURE CLAMPING
enableTClamp    false;
minT            200;           // Allow supercooling
maxT            10000;         // Ti plume temperatures

// TWO-TEMPERATURE MODEL - Optimized for nanoscale resolution
twoTemperatureProperties
{
    // Electronic heat capacity: Ce = γTe
    Ce
    {
        type        polynomial;
        value       0;
        coeffs
        (
            (0   0)      // Constant term = 0
            (630 1)      // Linear: Ce = 630·Te [J/m³/K²]
        );
    }

    // Temperature-dependent electron-phonon coupling
    G
    {
        type table;
        values
        (
            (300      1.0e18)
            (1000     2.0e18)
            (2000     1.5e18)
            (3000     4.0e18)
            (5000     1.5e19)
            (10000    8.0e19)
            (20000    2.5e20)
        );
    }

    Cl  [1 -1 -2 -1 0 0 0] 2.5e6;      // Lattice heat capacity
    De  [0  2 -1  0 0 0 0] 1e-4;       // Electron diffusivity

    // Gas-metal thermal exchange (Kapitza resistance)
    gasMetalExchangeCoeff
    {
        type        kapitza;
        Z_metal     2.3e7;      // Ti acoustic impedance
        Z_gas       383;        // Ar acoustic impedance
        rho_metal   4500;       // Ti density
        rho_gas     1.7;        // Ar density
        maxTemperature 0;       // No cap
    }

    gasMetalCutoffTemperature 2200;
    minMetalFractionForExchange 0.5;
    minGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 1e8;
    maxGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 5e9;
    maxGasMetalHeatFlux    5e9;

    minTe           200;
    maxTe           20000;         // Hot electrons allowed
    maxTl           10000;         // High lattice temperature
    ambientTemperature 300;
    temperatureDifferenceFloor 10.0;

    // ADAPTIVE MICRO-STEPPING - Critical for nanoscale cells!
    electronSubCycles        1;
    minElectronSubCycles     1;
    maxElectronSubCycles     50;         // Higher for 1nm cells
    maxElectronDeltaT        [0 0 1 0 0 0 0] 5e-16;  // 0.5 fs limit

    nInnerCouplingSweeps         3;      // More coupling iterations
    innerCouplingResidualTol     1e-4;   // Tight convergence

    klHighTThreshold 1000;
    klExponent       0.5;

    metalFractionFloor      1e-9;
    metalFractionCutoff     1e-6;
    metalAmbientBlendWidth  1e-3;
    CvolGasFloor            1e6;

    energyTolerance         0.01;       // Tight for nanoscale
    energyDiagnostics       true;
    temperatureDiagnostics  true;
    energyAudit             true;
}

// POST-PROCESSING AND MONITORING
functions
{
    // Field monitoring at key locations
    probePoints
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   10;

        fields
        (
            T
            Tl
            Te
            p_rgh
            alpha.metal
            U
        );

        probeLocations
        (
            (25e-6  20.0357e-6  5e-6)    // Center of Ti film
            (25e-6  20.0000e-6  5e-6)    // Ti-air interface (bottom)
            (25e-6  20.0714e-6  5e-6)    // Ti-donor interface (top)
            (25e-6  8.0000e-6   5e-6)    // Substrate-air interface
        );
    }

    // Mid-plane visualization
    midPlaneVTK
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    writeTime;
        writeInterval   1;
        surfaceFormat   vtk;
        fields          (alpha.metal Tl Te T p_rgh U);

        surfaces
        (
            midPlane
            {
                type                cuttingPlane;
                planeType           pointAndNormal;
                pointAndNormalDict
                {
                    point   (25e-6 10e-6 5e-6);
                    normal  (0 1 0);
                }
                interpolate         true;
            }
        );
    }

    // Volume-averaged quantities
    volumeAverages
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   10;
        writeFields     false;
        regionType      all;
        operation       volAverage;

        fields
        (
            T
            Tl
            Te
            alpha.metal
        );
    }
}

// ************************************************************************* //
